In [4]:
import pandas as pd 
import os

In [9]:

os.getcwd()
path = "Downloads/new_full_student_data.csv"

In [11]:
student_df = pd.read_csv(path)

In [12]:
print(student_df.head())

   student_id      student_name grade           school_name  reading_score  \
0   103880842     Travis Martin   9th  Sullivan High School           59.0
1    45069750     Michael Brown   9th     Dixon High School           94.7
2    45024902   Gabriela Lucero   9th    Wagner High School           89.0
3    62582498  Susan Richardson   9th     Silva High School           69.7
4    16437227      Sherry Davis  11th    Bowers High School            NaN

   math_score school_type  school_budget
0        88.2      Public         961125
1        73.5     Charter         870334
2        70.4      Public         846745
3        80.3      Public         991918
4        27.5      Public         848324

In [13]:
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [15]:
student_df = student_df.dropna()

In [17]:
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [18]:
student_df.duplicated().sum()

1836

In [19]:
student_df.duplicated().sum()

1836

In [13]:
student_df = student_df.drop_duplicates()

In [14]:
student_df.duplicated().sum()

0

In [15]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [16]:
student_df["grade"] = student_df["grade"].str.replace("th","")

In [17]:
student_df

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368
...,...,...,...,...,...,...,...,...
19508,83985333,Deborah Sanders,10,Silva High School,60.5,64.6,Public,991918
19509,109236636,Robert Sawyer,12,Silva High School,43.3,27.2,Public,991918
19511,95516554,Megan Gill,11,Wagner High School,93.9,84.1,Public,846745
19512,65050383,Lori Stone,11,Bowers High School,94.6,70.9,Public,848324
19513,34720657,Anna Jensen,12,Montgomery High School,82.3,42.4,Charter,893368

In [18]:
student_df["grade"] = student_df["grade"].astype("int64")

In [19]:
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [20]:
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [23]:
from statistics import mean

In [24]:
mean(student_df["math_score"])

64.6757332614119

In [25]:
student_df["reading_score"].min()

10.5

In [26]:
min_reading_score = student_df["reading_score"].min()

In [27]:
print(min_reading_score)

10.5

In [28]:
student_df.loc[:,"grade"]

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int64

In [29]:
student_df.iloc[0:3,[3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [30]:
student_df.loc[student_df.grade==9].describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [31]:
student_df.loc[student_df.reading_score==min_reading_score]

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [32]:
student_df.loc[((student_df.grade==10)&(student_df.school_name=="Dixon High School")),["school_name","reading_score"]]

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [33]:
mean(student_df.loc[((student_df.grade==11) |(student_df.grade==12))]["reading_score"])

74.90038089192191

In [35]:
student_df.groupby("school_type").mean().loc[:,["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [40]:
new_df= student_df.groupby("school_type").mean()

In [41]:
print(new_df)

               student_id      grade  reading_score  math_score  school_budget
school_type
Charter      7.004029e+07  10.346744      72.450603   66.761883  872625.656236
Public       6.951549e+07  10.362808      72.281219   62.951576  911195.558251

In [42]:
new_df.loc[:,["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [49]:
student_df.groupby(["school_name"])["school_name"].count().reset_index(name="student_count").sort_values(["student_count"],ascending=False,ignore_index=True)

               school_name  student_count
0   Montgomery High School           2038
1        Green High School           1961
2        Dixon High School           1583
3       Wagner High School           1541
4        Silva High School           1109
5        Woods High School           1052
6     Sullivan High School            971
7       Turner High School            846
8       Bowers High School            803
9       Fisher High School            798
10     Richard High School            551
11      Campos High School            541
12    Odonnell High School            459
13    Campbell High School            407
14       Chang High School            171

In [51]:
student_df.groupby(by=["school_type","grade"])["math_score"].mean().round()

school_type  grade
Charter      9        70.0
             10       66.0
             11       68.0
             12       60.0
Public       9        64.0
             10       64.0
             11       59.0
             12       64.0
Name: math_score, dtype: float64